{
	// When enabled, uses the overworldBorderCoords to set the border.
	"enableCustomOverworldBorder": true,
	// When enabled, uses the netherBorderCoords to set the border.
	"enableCustomNetherBorder": false,
	// When enabled, uses the endBorderCoords to set the border.
	"enableCustomEndBorder": true,
	// When enabled, instead of teleporting the player inside near where they were, teleports them from the positive to the negative x/z coord and vice versa.
	"shouldLoopToOppositeBorder": true,
	// The amount of blocks the player is teleported inside after hitting the border.
	"distanceTeleportedBack": 10,
	// The message which will be sent to the player when they are within 'distanceTeleportedBack' to the world border.
	"nearBorderMessage": "You're getting close to the world border!",
	// The message which will be sent to the player when they hit the world border.
	"hitBorderMessage": "You've hit the world border, and were teleported inside!",
	// The message sent to the player when they hit the border and 'shouldLoopToOppositeBorder' is enabled.
	"loopBorderMessage": "You've hit the world border, and have looped around the world!",
	// The overworld border located at the positive x coordinate.
	"overworldBorderPositiveX": 5000,
	// The overworld border located at the negative x coordinate.
	"overworldBorderNegativeX": -5000,
	// The overworld border located at the positive z coordinate.
	"overworldBorderPositiveZ": 5000,
	// The overworld border located at the negative z coordinate.
	"overworldBorderNegativeZ": -5000,
	// The nether border located at the positive x coordinate.
	"netherBorderPositiveX": 625,
	// The nether border located at the negative x coordinate.
	"netherBorderNegativeX": -625,
	// The nether border located at the positive z coordinate.
	"netherBorderPositiveZ": 625,
	// The nether border located at the negative z coordinate.
	"netherBorderNegativeZ": -625,
	// The end border located at the positive x coordinate.
	"endBorderPositiveX": 5000,
	// The end border located at the negative x coordinate.
	"endBorderNegativeX": -5000,
	// The end border located at the positive z coordinate.
	"endBorderPositiveZ": 5000,
	// The end border located at the negative z coordinate.
	"endBorderNegativeZ": -5000
}